In [0]:
import pandas as pd
import numpy as np

In [19]:
df = pd.DataFrame(np.array([[2015, 'Jurasic World', 'Action|Adventure|Science Fiction|Thriller'],
                           [2015, 'Insurgent', 'Adventure|Science Fiction|Thriller'],
                           [1966, 'The Sand Pebbles', 'Action|Adventure|Drama|War|Romance']]),
                  columns = ['year', 'title', 'genres'])
df

   year             title                                     genres
0  2015     Jurasic World  Action|Adventure|Science Fiction|Thriller
1  2015         Insurgent         Adventure|Science Fiction|Thriller
2  1966  The Sand Pebbles         Action|Adventure|Drama|War|Romance

In [0]:
# This function takes two arguments
# A pandas Series or a Dataframe column and a character variable (separater)
# Separate strings between the defined 'separater' 
# Return a stacked series

def separate(data, separater):
    return data.str[0:].str.split(separater, expand = True).stack()

In [0]:
# Separate genres column and join it to the dataframe.
# Use separate function above to split the string.
df = df.join(separate(df.genres, separater = '|').reset_index(level=1,drop=True).rename('genre')).reset_index(drop=True)

In [22]:
df

    year  ...            genre
0   2015  ...           Action
1   2015  ...        Adventure
2   2015  ...  Science Fiction
3   2015  ...         Thriller
4   2015  ...        Adventure
5   2015  ...  Science Fiction
6   2015  ...         Thriller
7   1966  ...           Action
8   1966  ...        Adventure
9   1966  ...            Drama
10  1966  ...              War
11  1966  ...          Romance

[12 rows x 4 columns]